# 4.6 Pickle walkthrough

### This script contains the following points:

#### 1. Merging of the orders and orders_products_prior
#### 2. Exporting the merged dataset in a pickle format

In [1]:
#Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Creating a path for the data imports

path = r'/Users/nekow/Documents/Instacart Basket Analysis'

In [3]:
#Importing Orders dataframe
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [4]:
#Importing Products dataframe
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [5]:
# Check the output

df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [6]:
df_prods.shape

(32434489, 4)

In [7]:
# Finding the duplicates

df_prods_dups = df_prods[df_prods.duplicated()]

In [8]:
# Check the output

df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [9]:
df_ords.shape

(3421083, 7)

## 1. Merging of the orders and products datasets

### Step 1 of Exercise 4.6

In [10]:
# merging the datasets
df_merged_large = df_ords.merge(df_prods, on = 'order_id')

In [11]:
# Data check
df_merged_large.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,prior,1,2,8,NaN,196,1,0
1,2539329,1,prior,1,2,8,NaN,14084,2,0
2,2539329,1,prior,1,2,8,NaN,12427,3,0
3,2539329,1,prior,1,2,8,NaN,26088,4,0
4,2539329,1,prior,1,2,8,NaN,26405,5,0

In [12]:
# Merged data check
df_merged_large.shape

(32434489, 10)

## 2. Exporting the merged dataset in a pickle format

### Step 2 of Exercise 4.6

In [13]:
# Exporting the merged pickle file
df_merged_large.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))